Repository: ShanePark/dutypark
Catalog: ios/Dutypark/Resources/OAuth.xcstrings
Source language: en
Languages: es, ja, ko, zh_hans

# auth.oauth.cancel
source: Cancel
es: Cancelar
ja: キャンセル
ko: 취소
zh_hans: 取消

# auth.oauth.divider
source: Social login
es: Inicio de sesión social
ja: ソーシャルログイン
ko: 소셜 로그인
zh_hans: 社交账号登录

# auth.oauth.error
source: Social login failed. Please try again.
es: Error de inicio de sesión social. Inténtalo de nuevo.
ja: ソーシャルログインに失敗しました。もう一度お試しください。
ko: 소셜 로그인에 실패했습니다. 다시 시도해주세요.
zh_hans: 社交账号登录失败，请重试。

# auth.oauth.kakao
source: Continue with Kakao
es: Continuar con Kakao
ja: Kakaoで続行
ko: 카카오 로그인
zh_hans: 使用 Kakao 继续

# auth.oauth.naver
source: Continue with Naver
es: Continuar con Naver
ja: Naverで続行
ko: 네이버 로그인
zh_hans: 使用 Naver 继续

# auth.oauth.signup.agree
source: I agree (required)
es: Acepto (obligatorio)
ja: 同意します（必須）
ko: 동의합니다 (필수)
zh_hans: 我同意（必需）

# auth.oauth.signup.error
source: Could not create your account.
es: No se pudo crear tu cuenta.
ja: アカウントを作成できませんでした。
ko: 회원가입에 실패했습니다.
zh_hans: 无法创建账号。

# auth.oauth.signup.name
source: Name
es: Nombre
ja: 名前
ko: 이름
zh_hans: 姓名

# auth.oauth.signup.name.help
source: Enter 1–10 characters.
es: Introduce entre 1 y 10 caracteres.
ja: 1〜10文字で入力してください。
ko: 1자 이상 10자 이하로 입력해주세요.
zh_hans: 请输入 1–10 个字符。

# auth.oauth.signup.name.placeholder
source: Your name
es: Tu nombre
ja: 名前
ko: 이름을 입력해주세요
zh_hans: 请输入姓名

# auth.oauth.signup.policyError
source: Could not load the required policies.
es: No se pudieron cargar las políticas requeridas.
ja: 必要なポリシーを読み込めませんでした。
ko: 필수 약관을 불러오지 못했습니다.
zh_hans: 无法加载必需政策。

# auth.oauth.signup.privacy
source: Privacy Policy
es: Política de privacidad
ja: プライバシーポリシー
ko: 개인정보 처리방침
zh_hans: 隐私政策

# auth.oauth.signup.submit
source: Create account
es: Crear cuenta
ja: アカウントを作成
ko: 가입하기
zh_hans: 创建账号

# auth.oauth.signup.terms
source: Terms of Service
es: Términos del servicio
ja: 利用規約
ko: 서비스 이용약관
zh_hans: 服务条款

# auth.oauth.signup.title
source: Create account
es: Crear cuenta
ja: アカウント作成
ko: 회원가입
zh_hans: 创建账号

# auth.oauth.signup.viewPolicy
source: View full text
es: Ver texto completo
ja: 全文を表示
ko: 전체보기
zh_hans: 查看全文
